integration/src/Catalogs/грВходящиеВнутренниеОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>грВходящиеВнутренниеОчереди</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОчередьОтключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗарезервированныхПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбрабатываемыеКлассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВнешниеСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Система</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.грСистемыИнтеграционногоКонтура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

integration/src/Catalogs/грВходящиеВнутренниеОчереди/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблКлассов.НомерСтроки КАК НомерСтроки,
	               |	ТаблКлассов.Класс КАК Класс
	               |ПОМЕСТИТЬ ВТТаблКлассов
	               |ИЗ
	               |	&ТаблКлассов КАК ТаблКлассов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТаблКлассов.НомерСтроки) КАК НомерСтроки,
	               |	ВТТаблКлассов.Класс КАК Класс
	               |ИЗ
	               |	ВТТаблКлассов КАК ВТТаблКлассов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТТаблКлассов.Класс
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТаблКлассов.НомерСтроки) > 1";
	Запрос.УстановитьПараметр("ТаблКлассов", ОбрабатываемыеКлассы.Выгрузить());
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обнаружены дубли классов. Запись невозможна.'"), Ссылка);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	грВходящиеВнутренниеОчереди.КоличествоЗарезервированныхПотоков КАК КоличествоЗарезервированныхПотоков
	               |ИЗ
	               |	Справочник.грВходящиеВнутренниеОчереди КАК грВходящиеВнутренниеОчереди
	               |ГДЕ
	               |	грВходящиеВнутренниеОчереди.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоЗарезервированныхПотоковБыло = Выборка.КоличествоЗарезервированныхПотоков;	
	Иначе
		КоличествоЗарезервированныхПотоковБыло = 0;	
	КонецЕсли;
	
	КоличествоИзмененных = КоличествоЗарезервированныхПотоков - КоличествоЗарезервированныхПотоковБыло;
	
	СтруктураВерности = грESBРаботаСКонстантами.ПроверитьЗаполнениеЗарезервированныхПотоков(КоличествоИзмененных);
	Если СтруктураВерности.Ошибка Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка при заполнении элемента Справочника.
                                                                          |Общее количество потоков: %1 меньше или зарезервированным  потокам. Общее: %2, для очередей: %3.'")
		, Формат(СтруктураВерности.ОбщееКоличествоПотоков, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ОбщееКоличествоЗарезервированныхПотоков, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ОбщееКоличествоЗарезервированныхПотоковПоОчередям + КоличествоИзмененных, "ЧДЦ=0; ЧН=0")));
	КонецЕсли;
	
КонецПроцедуры
